balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC10F322.PIC
        <edc:Module_ref edc:begin="0x0" edc:end="8" edc:modsrc="DOS-01444B_NC0_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xf" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x0" edc:offset="0x5"/>
          <edc:ModuleExclude edc:impl="0xf3" edc:offset="0x7"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--010110" edc:name="WDTCON" edc:nzwidth="8" edc:por="--010110">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-01451_CLC-4xx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x4" edc:modsrc="DOS-01451_CLC-4xx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="2" edc:modsrc="DOS-01451_CLC-4xx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0x8" edc:modsrc="DOS-01451_CLC-4xx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x5" edc:modsrc="DOS-01488_A4.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xf9" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xf3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xf3" edc:offset="0x3"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="FLT"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="CLC1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01488_A4.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:SFRDef edc:access="------nn" edc:cname="VREGCON" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="VREGCON" edc:nzwidth="8" edc:por="------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VREGPM" edc:desc="" edc:mask="0x3" edc:name="VREGPM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VREGPM0" edc:desc="" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VREGPM1" edc:desc="" edc:mask="0x1" edc:name="VREGPM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-----n" edc:cname="BORCON" edc:desc="" edc:impl="0xc1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-----u" edc:name="BORCON" edc:nzwidth="8" edc:por="10-----q">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:desc="" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="BORFS" edc:desc="" edc:mask="0x1" edc:name="BORFS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:desc="" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x40" edc:endaddr="0x80" edc:regionid="gpr0"/>
      <edc:EmulatorZone edc:beginaddr="0x90" edc:endaddr="0xb7" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="PWM1"/>
      <edc:VirtualPin edc:name="CLC1IN1"/>
      <edc:VirtualPin edc:name="CWG1A"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="PWM2"/>
      <edc:VirtualPin edc:name="CLC1"/>
      <edc:VirtualPin edc:name="CWG1B"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
      <edc:VirtualPin edc:name="NCO1CLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="NCO1"/>
      <edc:VirtualPin edc:name="CLC1IN2"/>
      <edc:VirtualPin edc:name="CLKR"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="CWG1FLT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="VPP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>